stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/BLE_Speaker/Applications/BLE/BLE_Audio_Broadcast_Speaker/Core/Src/app_entry.c
#endif  /* CFG_JOYSTICK_SUPPORTED */

/**
  * @brief Configure PLL for the audio frequency, PLL output is used for the SAI peripheral and as the core clock
  * @retval None
  */
void AudioClock_Init(uint32_t audio_frequency_type)
{
  uint32_t target_freq;
  if (audio_frequency_type == SAMPLE_FREQ_44100_HZ)
  {
    target_freq = 90316800;
  }
  else
  {
    /* valid for 8k, 16k, 24k, 32k or 48k */
    target_freq = 98304000;
  }

  if ( target_freq !=  PLL_Target_Clock_Freq )
  {
    scm_pll_config_t pll_config;
    LOG_INFO_APP("Audio Clock Initialization\n");

    pll_config.pll_mode = PLL_FRACTIONAL_MODE;
    pll_config.PLLM = 6;
    pll_config.PLLP = 4;
    pll_config.PLLQ = 4;
    pll_config.PLLR = 4;

    /* VCO frequency should be in range 128 to 544 MHz */
    /* PLL fractionnal should allows to cover +/-550ppm around the targeted frequency*/
    if (target_freq == 90316800)
    {
      pll_config.PLLN = 67;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (67 + 1) = 362.7 MHz */
      pll_config.PLLFractional = 6042;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_3;
      /* PLLSYS = 90.31673 MHz */
    }
    else
    {
      pll_config.PLLN = 73;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (73 + 1) = 394.7 MHz */
      pll_config.PLLFractional = 5964;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_4;
      /* PLLSYS = 98.30396 MHz */
    }

    UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_DISABLE);

    scm_pll_setconfig(&pll_config);

    scm_setsystemclock(SCM_USER_APP, SYS_PLL);

    /* enable P output used for the audio timer */
    LL_RCC_PLL1_EnableDomain_PLL1P();

    PLL_Target_Clock_Freq = target_freq;
  }
  else
  {
    LOG_INFO_APP("Audio Clock already configured\n");
  }
}

void PLL_Ready_ProcessIT(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_PLL_READY_ID, CFG_SEQ_PRIO_0);
}

void PLL_Ready_Task(void)
{
  /* set Link Layer audio timings */
  uint32_t iso_exec_time;
  Evnt_timing_t event_time;
  event_time.drift_time    = ISO_PLL_DRIFT_TIME;
  event_time.exec_time     = ISO_PLL_EXEC_TIME;
  event_time.schdling_time = ISO_PLL_SCHDL_TIME;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += ISO_PLL_DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += ISO_PLL_EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &iso_exec_time);

  CODEC_CLK_Init();

  AUDIO_PLLConfig_t corrector_pll_config;
  corrector_pll_config.PLLTargetFreq = PLL_Target_Clock_Freq;
  corrector_pll_config.VCOInputFreq = (32000000.0f / 6.0f); /* HSE / PLL_M */
  corrector_pll_config.PLLOutputDiv = 4; /* PLL_P */
  AUDIO_InitializeClockCorrector(&corrector_pll_config, 500, 4000);

}

void PLL_Exit(void)
{
  if (PLL_Target_Clock_Freq != 0)
  {
    scm_setsystemclock(SCM_USER_APP, NO_CLOCK_CONFIG);

    PLL_Target_Clock_Freq = 0;

    UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_ENABLE);
  }
}


static void AudioClock_Deinit( void )
{
  /* back to default timings */
  Evnt_timing_t event_time;
  event_time.drift_time    = DRIFT_TIME_DEFAULT;
  event_time.exec_time     = EXEC_TIME_DEFAULT;
  event_time.schdling_time = SCHDL_TIME_DEFAULT;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &gDefault_Exec_Time);

  LOG_INFO_APP("Audio Clock Deinitialization\n");

  AUDIO_DeinitializeClockCorrector();
}

HAL_StatusTypeDef MX_SAI1_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t SampleRate)
{
  /* PLL already configured */

  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
  PeriphClkInit.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL1P;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_RCC_SAI1_CLK_ENABLE();

  return HAL_OK;
}


void MX_AudioInit(Audio_Role_t role,
                  Sampling_Freq_t sampling_frequency,
                  Frame_Duration_t frame_duration,
                  uint8_t *pSnkBuff,
                  uint8_t *pSrcBuff)
{
  uint32_t sample_per_frame;
  uint32_t audioFrequency;
  uint32_t channel_at_src;
  SpeakerAudioConfig_t driver_mode = CONFIG_SIMPLEX;
  BSP_AUDIO_Init_t audio_conf;

  if (pSrcBuff != NULL)
  {
    driver_mode = CONFIG_DUPLEX;
  }

  switch (sampling_frequency)
  {
    case SAMPLE_FREQ_8000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_8K;
      break;

    case SAMPLE_FREQ_16000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_16K;
      break;

    case SAMPLE_FREQ_22050_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_22K;
      break;

    case SAMPLE_FREQ_24000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_24K;
      break;

    case SAMPLE_FREQ_32000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_32K;
      break;

    case SAMPLE_FREQ_44100_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_44K;
      break;

    case SAMPLE_FREQ_48000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_48K;
      break;

    default:
      Error_Handler();
      return;
  }

  if (sampling_frequency == SAMPLE_FREQ_44100_HZ)
  {
    /* LC3 need setup like 48Khz for this frequency */
    switch(frame_duration)
    {
      case FRAME_DURATION_7_5_MS:
        sample_per_frame = 360;
        break;

      case FRAME_DURATION_10_MS:
        sample_per_frame = 480;
        break;

      default:
        Error_Handler();
        return;
    }
  }
  else
  {
	switch(frame_duration)
	{
      case FRAME_DURATION_7_5_MS:
        sample_per_frame = audioFrequency * 75 / 10000;
        break;

      case FRAME_DURATION_10_MS:
        sample_per_frame = audioFrequency * 100 / 10000;
        break;

      default:
        Error_Handler();
        return;
	}
  }

  __HAL_RCC_I2C3_CLK_ENABLE();

  Speaker_audio_start(driver_mode, audioFrequency, (uint8_t)VOLUME_VCP_TO_VOLUME_BSP(Current_Volume));

  audio_conf.Device = AUDIO_IN_DEVICE_ANALOG_MIC;
  audio_conf.ChannelsNbr = 2;
  channel_at_src = 2;

  audio_conf.Volume = 50; /* input volume is not used */
  audio_conf.SampleRate = audioFrequency;
  audio_conf.BitsPerSample = AUDIO_RESOLUTION_16B;
  if (BSP_AUDIO_IN_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
    /* Release Bus for power consumption optimisation */
    __HAL_RCC_I2C3_CLK_DISABLE();
    return;
  }

