stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/BLE_Speaker/Applications/BLE/BLE_Audio_Broadcast_Speaker/Core/Src/app_entry.c
  audio_conf.Device = AUDIO_OUT_DEVICE_HEADPHONE;
  audio_conf.ChannelsNbr = 2;
  audio_conf.Volume = Current_Volume;
  if (BSP_AUDIO_OUT_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
    /* Release Bus for power consumption optimisation */
    __HAL_RCC_I2C3_CLK_DISABLE();
    return;
  }

  /* Start SAI clock without DMA interrupt */
  uint8_t channel_at_snk = 2;   /* SAI is in stereo for Headset */
  uint8_t buffer_nb = 2;        /* double buffer strategy for minimum latency*/
  uint8_t bytes_per_sample = 2;

  Sink_frame_size = sample_per_frame * channel_at_snk * buffer_nb;
  Source_frame_size = sample_per_frame * channel_at_src * buffer_nb;
  /* Start SAI clock without DMA interrupt */
  Init_AudioBuffer((uint8_t *)pSnkBuff,
                   Sink_frame_size * bytes_per_sample,
                   (uint8_t *)pSrcBuff,
                   Source_frame_size * bytes_per_sample);

  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C3_CLK_DISABLE();
  MxAudioInit_Flag = 1;

}

void MX_AudioDeInit(void)
{
  if (MxAudioInit_Flag == 1)
  {
    MxAudioInit_Flag = 0;

    Speaker_audio_stop();

    if (BSP_AUDIO_IN_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    if (BSP_AUDIO_OUT_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    SET_BIT(haudio_in_sai.Instance->CR2, SAI_xCR2_FFLUSH);
    SET_BIT(haudio_out_sai.Instance->CR2, SAI_xCR2_FFLUSH);
  }

  AudioClock_Deinit();
}

static void Init_AudioBuffer(uint8_t *pSnkBuff, uint16_t SnkBuffLen, uint8_t *pSrcBuff, uint16_t SrcBuffLen)
{
  /* We start the SAI here but will pause the DMA on the first interrupt.
     The DMA will be relauched synchronized to the BLE transport for mastering audio latency */
  if ((SnkBuffLen  > 0) && (pSnkBuff != NULL))
  {
    if (BSP_AUDIO_OUT_Play(0, (uint8_t *)pSnkBuff, SnkBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Play_Req_Pause = 1;
  }
  if ((SrcBuffLen  > 0) && (pSrcBuff != NULL))
  {
    if (BSP_AUDIO_IN_Record(0, (uint8_t *)pSrcBuff, SrcBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Record_Req_Pause = 1;
  }
}

int32_t Start_TxAudio(void)
{
  int32_t status = 1;

  /* restart DMA request only if it was on pause */
  if ((haudio_out_sai.Instance->CR1 & SAI_xCR1_DMAEN) == 0)
  {
    SET_BIT(haudio_out_sai.Instance->CR2, SAI_xCR2_FFLUSH);
    haudio_out_sai.Instance->CR1 |= SAI_xCR1_DMAEN;
    status = 0;

    APP_NotifyTxAudioCplt(Sink_frame_size);
  }

  LOG_INFO_APP("START AUDIO SINK (output)\n");

  return status;
}

void Stop_TxAudio(void)
{
  if (BSP_AUDIO_OUT_Stop(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }
}

void BSP_AUDIO_OUT_TransferComplete_CallBack(uint32_t instance)
{
  APP_NotifyTxAudioCplt(Sink_frame_size);
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(uint32_t instance)
{
  if (MxAudioInit_Flag == 1)
  {
    if (Play_Req_Pause == 1)
    {
      /* Pause the DMA aligned on a interrupt and wait the codec trigger to restart it synchronized to BLE */
      haudio_out_sai.Instance->CR1 &= ~SAI_xCR1_DMAEN;

      Play_Req_Pause = 0;
    }
    else
    {
      APP_NotifyTxAudioHalfCplt();
    }
  }
}

int32_t Start_RxAudio(void)
{
  int32_t status = 1;

  /* restart DMA request only if it was on pause */
  if ((haudio_in_sai.Instance->CR1 & SAI_xCR1_DMAEN) == 0)
  {
    SET_BIT(haudio_in_sai.Instance->CR2, SAI_xCR2_FFLUSH);
    haudio_in_sai.Instance->CR1 |= SAI_xCR1_DMAEN;
    status = 0;
  }

  LOG_INFO_APP("START AUDIO SOURCE (input)\n");

  return status;
}

void Stop_RxAudio(void)
{
  if (BSP_AUDIO_IN_Stop(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }
}

void BSP_AUDIO_IN_TransferComplete_CallBack(uint32_t instance)
{
  APP_NotifyRxAudioCplt(Source_frame_size);
}

void BSP_AUDIO_IN_HalfTransfer_CallBack(uint32_t instance)
{
  if (MxAudioInit_Flag == 1)
  {
    if (Record_Req_Pause == 1)
    {
      /* Pause the DMA aligned on a interrupt and wait the codec trigger to restart it synchronized to BLE */
      haudio_in_sai.Instance->CR1 &= ~SAI_xCR1_DMAEN;

      Record_Req_Pause = 0;
    }
    else
    {
      APP_NotifyRxAudioHalfCplt();
    }
  }
}

void Set_Volume(uint8_t Volume)
{
  Current_Volume = VOLUME_VCP_TO_VOLUME_BSP(Volume);

  __HAL_RCC_I2C3_CLK_ENABLE();
  BSP_AUDIO_OUT_SetVolume(0, Current_Volume);
  __HAL_RCC_I2C3_CLK_DISABLE();
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void UTIL_SEQ_Idle( void )
{
#if ( CFG_LPM_LEVEL != 0)
  HAL_SuspendTick();
#if (CFG_SCM_SUPPORTED == 1)
  /* SCM HSE BEGIN */
  SCM_HSE_StopStabilizationTimer();
  /* SCM HSE END */
#endif /* CFG_SCM_SUPPORTED */
  UTIL_LPM_EnterLowPower();
  HAL_ResumeTick();
#endif /* CFG_LPM_LEVEL */
  return;
}

extern I2C_HandleTypeDef hi2c3;
void UTIL_SEQ_PreIdle( void )
{
  /* USER CODE BEGIN UTIL_SEQ_PreIdle_1 */
  HAL_I2C_MspDeInit(&hi2c3);
  /* USER CODE END UTIL_SEQ_PreIdle_1 */
#if ( CFG_LPM_LEVEL != 0)
  LL_PWR_ClearFlag_STOP();

  if ( ( system_startup_done != FALSE ) && ( UTIL_LPM_GetMode() == UTIL_LPM_OFFMODE ) )
  {
    APP_SYS_BLE_EnterDeepSleep();
  }

  LL_RCC_ClearResetFlags();

#if defined(STM32WBAXX_SI_CUT1_0)
  /* Wait until HSE is ready */
#if (CFG_SCM_SUPPORTED == 1)
  /* SCM HSE BEGIN */
  SCM_HSE_WaitUntilReady();
  /* SCM HSE END */
#else
  while (LL_RCC_HSE_IsReady() == 0);
#endif /* CFG_SCM_SUPPORTED */

  UTILS_ENTER_LIMITED_CRITICAL_SECTION(RCC_INTR_PRIO << 4U);
  scm_hserdy_isr();
  UTILS_EXIT_LIMITED_CRITICAL_SECTION();
#endif /* STM32WBAXX_SI_CUT1_0 */
#endif /* CFG_LPM_LEVEL */
  /* USER CODE BEGIN UTIL_SEQ_PreIdle_2 */

  /* USER CODE END UTIL_SEQ_PreIdle_2 */
  return;
}

void UTIL_SEQ_PostIdle( void )
{
  /* USER CODE BEGIN UTIL_SEQ_PostIdle_1 */

  /* USER CODE END UTIL_SEQ_PostIdle_1 */
#if ( CFG_LPM_LEVEL != 0)
  LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_RADIO);
  (void)ll_sys_dp_slp_exit();
  UTIL_LPM_SetOffMode(1U << CFG_LPM_LL_DEEPSLEEP, UTIL_LPM_ENABLE);
#endif /* CFG_LPM_LEVEL */
  /* USER CODE BEGIN UTIL_SEQ_PostIdle_2 */
  HAL_I2C_MspInit(&hi2c3);
  /* USER CODE END UTIL_SEQ_PostIdle_2 */
  return;
}

void BPKACB_Process( void )
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_BPKA, CFG_SEQ_PRIO_0);
}

/**
 * @brief Callback used by Random Number Generator to launch Task to generate Random Numbers
 */
void HWCB_RNG_Process( void )
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_HW_RNG, TASK_PRIO_RNG);
}

